const Map<String, Map<int, String>> questionsData = {
  'Природа': {
    500: 'Какое животное является самым быстрым на суше?',
    1000: 'Какое дерево является символом России?',
    1500: 'Какой океан является самым большим на Земле?',
    2000: 'Какое озеро является самым глубоким в мире?',
    2500: 'Какой газ составляет основную часть атмосферы Земли?',
  },
  'Еда': {
    500: 'Из какой страны происходит пицца?',
    1000: 'Какой фрукт является основным ингредиентом гуакамоле?',
    1500: 'Какая специя является самой дорогой в мире?',
    2000: 'Из какого зерна делают японский напиток саке?',
    2500: 'Какой сыр традиционно используется в тирамису?',
  },
  'Памятники': {
    500: 'В каком городе находится Эйфелева башня?',
    1000: 'Сколько чудес света в классическом списке?',
    1500: 'Как назывался древнегреческий город-государство, известный своей военной дисциплиной?',
    2000: 'В какой стране находится мавзолей Тадж-Махал?',
    2500: 'Какой храм расположен на Акрополе в Афинах?',
  },
  'История': {
    500: 'В каком году человек впервые полетел в космос?',
    1000: 'Кто был первым президентом Соединённых Штатов Америки?',
    1500: 'В каком году закончилась Вторая мировая война?',
    2000: 'Как называлась столица Византийской империи?',
    2500: 'В каком году пала Западная Римская империя?',
  },
  'Книги': {
    500: 'Кто написал роман «Война и мир»?',
    1000: 'Кто является автором серии книг о Гарри Поттере?',
    1500: 'Как зовут главного героя романа «Преступление и наказание»?',
    2000: 'Кто написал роман «Мастер и Маргарита»?',
    2500: 'Как называется первая книга Библии?',
  },
};
